# AlignmentStationLabelDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlignmentStationLabelDistance Property
ParameterTypeId Class See Also
---
"Distance": Currently not in use
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlignmentStationLabelDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlignmentStationLabelDistance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlignmentStationLabelDistance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace